package org.example.strings.tools;

import java.util.*;
import java.util.Map.Entry;
import java.util.regex.Matcher;
import java.util.regex.Pattern;


import static java.lang.String.valueOf;

public class MyStrings {

    public static void blankspace() {
        System.out.println("\n----------------------------------------------------------------------------------\n");
    }

    public static String createMonsterString() {
        return (" Не следует, однако забывать, что рамки и место обучения кадров требуют от нас анализа форм развития. Идейные соображения высшего порядка, а также сложившаяся структура организации требуют от нас анализа систем массового участия. Равным образом рамки и место обучения кадров играет важную роль в формировании новых предложений. Задача организации, в особенности же рамки и место обучения кадров влечет за собой процесс внедрения и модернизации форм развития. Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет оценить значение модели развития. С другой стороны постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки форм развития.\n" +
                "\n" +
                "Повседневная практика показывает, что начало повседневной работы по формированию позиции требуют от нас анализа модели развития. Не следует, однако забывать, что новая модель организационной деятельности влечет за собой процесс внедрения и модернизации форм развития. Не следует, однако забывать, что рамки и место обучения кадров влечет за собой процесс внедрения и модернизации модели развития. Товарищи! рамки и место обучения кадров играет важную роль в формировании новых предложений.\n" +
                "\n" +
                "Не следует, однако забывать, что дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции требуют определения и уточнения направлений прогрессивного развития. Не следует, однако забывать, что новая модель организационной деятельности требуют от нас анализа существенных финансовых и административных условий. Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности требуют от нас анализа дальнейших направлений развития. Не следует, однако забывать, что укрепление и развитие структуры играет важную роль в формировании форм развития.\n" +
                "\n" +
                "Значимость этих проблем настолько очевидна, что реализация намеченных плановых заданий требуют от нас анализа систем массового участия. Разнообразный и богатый опыт постоянный количественный рост и сфера нашей активности позволяет оценить значение дальнейших направлений развития.\n" +
                "\n" +
                "Разнообразный и богатый опыт рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям. Товарищи! постоянный количественный рост и сфера нашей активности влечет за собой процесс внедрения и модернизации позиций, занимаемых участниками в отношении поставленных задач.\n" +
                "\n" +
                "Равным образом рамки и место обучения кадров играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. С другой стороны рамки и место обучения кадров позволяет выполнять важные задания по разработке модели развития. С другой стороны постоянный количественный рост и сфера нашей активности позволяет выполнять важные задания по разработке форм развития. Не следует, однако забывать, что реализация намеченных плановых заданий в значительной степени обуславливает создание модели развития. Таким образом рамки и место обучения кадров требуют от нас анализа модели развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации позиций, занимаемых участниками в отношении поставленных задач.\n" +
                "\n" +
                "Разнообразный и богатый опыт новая модель организационной деятельности требуют от нас анализа существенных финансовых и административных условий. Товарищи! укрепление и развитие структуры требуют определения и уточнения существенных финансовых и административных условий.\n" +
                "\n" +
                "Равным образом постоянный количественный рост и сфера нашей активности позволяет оценить значение модели развития. Таким образом консультация с широким активом в значительной степени обуславливает создание системы обучения кадров, соответствует насущным потребностям.\n" +
                "\n" +
                "Идейные соображения высшего порядка, а также дальнейшее развитие различных форм деятельности способствует подготовки и реализации форм развития. С другой стороны дальнейшее развитие различных форм деятельности обеспечивает широкому кругу (специалистов) участие в формировании новых предложений. С другой стороны новая модель организационной деятельности влечет за собой процесс внедрения и модернизации соответствующий условий активизации.\n" +
                "\n" +
                "Задача организации, в особенности же укрепление и развитие структуры играет важную роль в формировании форм развития. Повседневная практика показывает, что дальнейшее развитие различных форм деятельности требуют от нас анализа системы обучения кадров, соответствует насущным потребностям. Задача организации, в особенности же реализация намеченных плановых заданий требуют от нас анализа существенных финансовых и административных условий. Повседневная практика показывает, что рамки и место обучения кадров представляет собой интересный эксперимент проверки модели развития.\n" +
                "\n" +
                "Задача организации, в особенности же реализация намеченных плановых заданий представляет собой интересный эксперимент проверки систем массового участия. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании форм развития. Таким образом реализация намеченных плановых заданий играет важную роль в формировании новых предложений. Разнообразный и богатый опыт новая модель организационной деятельности требуют определения и уточнения существенных финансовых и административных условий. Таким образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки системы обучения кадров, соответствует насущным потребностям. С другой стороны сложившаяся структура организации играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач.\n" +
                "\n" +
                "С другой стороны укрепление и развитие структуры требуют от нас анализа систем массового участия. Задача организации, в особенности же начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации модели развития. Равным образом укрепление и развитие структуры играет важную роль в формировании существенных финансовых и административных условий. Задача организации, в особенности же постоянный количественный рост и сфера нашей активности позволяет выполнять важные задания по разработке направлений прогрессивного развития. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки систем массового участия. Задача организации, в особенности же консультация с широким активом играет важную роль в формировании форм развития.\n" +
                "\n" +
                "Повседневная практика показывает, что начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке форм развития. Разнообразный и богатый опыт новая модель организационной деятельности требуют от нас анализа систем массового участия.\n" +
                "\n" +
                "Значимость этих проблем настолько очевидна, что сложившаяся структура организации позволяет оценить значение систем массового участия. Повседневная практика показывает, что начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке соответствующий условий активизации.\n" +
                "\n" +
                "С другой стороны постоянный количественный рост и сфера нашей активности способствует подготовки и реализации существенных финансовых и административных условий. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет выполнять важные задания по разработке направлений прогрессивного развития. Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации соответствующий условий активизации. Повседневная практика показывает, что начало повседневной работы по формированию позиции требуют от нас анализа позиций, занимаемых участниками в отношении поставленных задач.\n" +
                "\n" +
                "Равным образом консультация с широким активом влечет за собой процесс внедрения и модернизации модели развития. Не следует, однако забывать, что новая модель организационной деятельности позволяет оценить значение форм развития. Товарищи! сложившаяся структура организации играет важную роль в формировании систем массового участия. Разнообразный и богатый опыт постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки модели развития.\n" +
                "\n" +
                "Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также новая модель организационной деятельности требуют от нас анализа форм развития.\n" +
                "\n" +
                "Разнообразный и богатый опыт постоянный количественный рост и сфера нашей активности требуют определения и уточнения форм развития. С другой стороны сложившаяся структура организации способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. С другой стороны новая модель организационной деятельности требуют от нас анализа позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также начало повседневной работы по формированию позиции требуют определения и уточнения дальнейших направлений развития. Разнообразный и богатый опыт новая модель организационной деятельности представляет собой интересный эксперимент проверки дальнейших направлений развития.\n" +
                "\n" +
                "С другой стороны консультация с широким активом представляет собой интересный эксперимент проверки форм развития. Идейные соображения высшего порядка, а также консультация с широким активом позволяет выполнять важные задания по разработке существенных финансовых и административных условий. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени обуславливает создание форм развития. Равным образом постоянный количественный рост и сфера нашей активности позволяет выполнять важные задания по разработке существенных финансовых и административных условий. Товарищи! реализация намеченных плановых заданий способствует подготовки и реализации существенных финансовых и административных условий. Повседневная практика показывает, что укрепление и развитие структуры требуют определения и уточнения новых предложений.\n" +
                "\n" +
                "Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет оценить значение системы обучения кадров, соответствует насущным потребностям. С другой стороны консультация с широким активом позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности играет важную роль в формировании существенных финансовых и административных условий. Товарищи! укрепление и развитие структуры требуют от нас анализа дальнейших направлений развития. ");
    }

    public static void printmap(Map<String, Integer> map) {
        for (Entry m : map.entrySet()) {
            System.out.println(m.getKey() + "  -  " + m.getValue());
        }
    }


    public static Map<String, Integer> countSymbolOccurrencies(String str) {

        Map<String, Integer> unsortedMap = new HashMap<String, Integer>();
        for (int i = 0; i < str.length(); i++) {
            if (unsortedMap.containsKey(valueOf(str.charAt(i)))) {
                unsortedMap.replace(valueOf(str.charAt(i)), unsortedMap.get(valueOf(str.charAt(i))) + 1);
            } else {
                unsortedMap.put(valueOf(str.charAt(i)), 1);
            }
        }
        Map<String, Integer> sortedMap = sortByComparator(unsortedMap, true);
        return sortedMap;
    }

    public static Map<String, Integer> countWordsOccurrencies(String str) {
        Map<String, Integer> unsortedMap = new HashMap<String, Integer>();
        String regex = "[а-яА-Я]+";
        Pattern p = Pattern.compile(regex);
        Matcher m = p.matcher(str);
        String word;
        while (m.find()) {
            word = m.group().toLowerCase();
            if (unsortedMap.containsKey(word)) {
                unsortedMap.replace(word, unsortedMap.get(word) + 1);
            } else {
                unsortedMap.put(word, 1);
            }
        }
        Map<String, Integer> sortedMap = sortByComparator(unsortedMap, true);
        return sortedMap;
    }

    public static Map<String, Integer> sortByComparator(Map<String, Integer> unsortMap, final boolean order) {

        List<Entry<String, Integer>> list = new LinkedList<Entry<String, Integer>>(unsortMap.entrySet());

        Collections.sort(list, new Comparator<Entry<String, Integer>>() {
            public int compare(Entry<String, Integer> o1,
                               Entry<String, Integer> o2) {
                if (order) {
                    return o1.getValue().compareTo(o2.getValue());
                } else {
                    return o2.getValue().compareTo(o1.getValue());

                }
            }
        });

        Map<String, Integer> sortedMap = new LinkedHashMap<String, Integer>();
        for (Entry<String, Integer> entry : list) {
            sortedMap.put(entry.getKey(), entry.getValue());
        }

        return sortedMap;
    }

    public static void printSymbolsMap(Map<String, Integer> map) {
        System.out.println("Символы из текста:\n");
        for (Entry<String, Integer> entry : map.entrySet()) {
            if (entry.getKey().charAt(0) == '\n') {
                System.out.println("\\n - " + entry.getValue());
            } else if (entry.getKey().charAt(0) == ' ') {
                System.out.println("\\s - " + entry.getValue());
            } else {
                System.out.println(entry.getKey() + " - " + entry.getValue());
            }
        }

    }

    public static void printWordsMap(Map<String, Integer> map) {
        System.out.println("Слова из текста:\n");
        for (Entry<String, Integer> entry : map.entrySet()) {
            System.out.println(entry.getKey() + " - " + entry.getValue());
        }

    }
}

